Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.0.26/saml21b/edc/ATSAML21J17BU.PIC
      <edc:SFRDef edc:_addr="0x43001C14" edc:access="nnnnnnnn-nnnnnnnnnnnnnnnn-nn--n-" edc:cname="LUTCTRL3" edc:impl="0xFF7FFFB2" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CCL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CCL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="LUT Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FILTSEL" edc:desc="Filter Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Filter disabled" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SYNCH" edc:desc="Synchronizer enabled" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FILTER" edc:desc="Filter enabled" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EDGESEL" edc:desc="Edge Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INSEL0" edc:desc="Input Selection 0" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="MASK" edc:desc="Masked input" edc:when="(field &amp; 0xF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FEEDBACK" edc:desc="Feedback input source" edc:when="(field &amp; 0xF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="LINK" edc:desc="Linked LUT input source" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="EVENT" edc:desc="Event in put source" edc:when="(field &amp; 0xF) == 3"/>
              <edc:SFRFieldSemantic edc:cname="IO" edc:desc="I/O pin input source" edc:when="(field &amp; 0xF) == 4"/>
              <edc:SFRFieldSemantic edc:cname="AC" edc:desc="AC input source" edc:when="(field &amp; 0xF) == 5"/>
              <edc:SFRFieldSemantic edc:cname="TC" edc:desc="TC input source" edc:when="(field &amp; 0xF) == 6"/>
              <edc:SFRFieldSemantic edc:cname="ALTTC" edc:desc="Alternate TC input source" edc:when="(field &amp; 0xF) == 7"/>
              <edc:SFRFieldSemantic edc:cname="TCC" edc:desc="TCC input source" edc:when="(field &amp; 0xF) == 8"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM" edc:desc="SERCOM inout source" edc:when="(field &amp; 0xF) == 9"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INSEL1" edc:desc="Input Selection 1" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="INSEL2" edc:desc="Input Selection 2" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="INVEI" edc:desc="Input Event Invert" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LUTEI" edc:desc="Event Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LUTEO" edc:desc="Event Output Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TRUTH" edc:desc="Truth Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x43001C18" edc:offset="0xFFE3E8"/>
      <edc:SFRDef edc:_addr="0x44000000" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WRCTRL" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PERID" edc:desc="Peripheral identifier" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:desc="Peripheral access control key" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="No action" edc:when="(field &amp; 0xFF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CLR" edc:desc="Clear protection" edc:when="(field &amp; 0xFF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="Set protection" edc:when="(field &amp; 0xFF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SETLCK" edc:desc="Set and lock protection" edc:when="(field &amp; 0xFF) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44000004" edc:access="-------n" edc:cname="EVCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="ERREO" edc:desc="Peripheral acess error event output" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x44000005" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x44000008" edc:access="-------n" edc:cname="INTENCLR" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="Peripheral access error interrupt disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44000009" edc:access="-------n" edc:cname="INTENSET" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="Peripheral access error interrupt enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4400000A" edc:offset="0x6"/>
      <edc:SFRDef edc:_addr="0x44000010" edc:access="------nnnnn-nnnn-----------nnnnn" edc:cname="INTFLAGAHB" edc:impl="0x3EF001F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="FLASH_" edc:desc="FLASH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSRAMCM0P_" edc:desc="HSRAMCM0P" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSRAMDSU_" edc:desc="HSRAMDSU" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HPB1_" edc:desc="HPB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="H2LBRIDGES_" edc:desc="H2LBRIDGES" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="HPB0_" edc:desc="HPB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HPB2_" edc:desc="HPB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HPB3_" edc:desc="HPB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HPB4_" edc:desc="HPB4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LPRAMHS_" edc:desc="LPRAMHS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPRAMPICOP_" edc:desc="LPRAMPICOP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPRAMDMAC_" edc:desc="LPRAMDMAC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="L2HBRIDGES_" edc:desc="L2HBRIDGES" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSRAMLP_" edc:desc="HSRAMLP" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44000014" edc:access="---------------------nnnnnnnnnnn" edc:cname="INTFLAGA" edc:impl="0x7FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PM_" edc:desc="PM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCLK_" edc:desc="MCLK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTC_" edc:desc="RSTC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCCTRL_" edc:desc="OSCCTRL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC32KCTRL_" edc:desc="OSC32KCTRL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUPC_" edc:desc="SUPC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GCLK_" edc:desc="GCLK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDT_" edc:desc="WDT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTC_" edc:desc="RTC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIC_" edc:desc="EIC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PORT_" edc:desc="PORT" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
